nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/driver_examples/cadc/pit_trigger_edma_conversion/pin_mux.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOC11 (number 37), U16[25]/TXD1
  @{ */
#define BOARD_TXD1_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_TXD1_PIN 11U              /*!<@brief GPIOC pin index: 11 */
#define BOARD_TXD1_PIN_MASK kGPIO_Pin11 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC12 (number 38), U16[26]/RXD1
  @{ */
#define BOARD_RXD1_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_RXD1_PIN 12U              /*!<@brief GPIOC pin index: 12 */
#define BOARD_RXD1_PIN_MASK kGPIO_Pin12 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOA6 (number 10), ANTP
  @{ */
#define BOARD_THER_A_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THER_A_PIN 6U              /*!<@brief GPIOA pin index: 6 */
#define BOARD_THER_A_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name GPIOA7 (number 9), ANTN
  @{ */
#define BOARD_THER_B_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THER_B_PIN 7U              /*!<@brief GPIOA pin index: 7 */
#define BOARD_THER_B_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
